NextFOAM-2405/tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    wallFilm
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
//        type            mapped;
//        field           Usf;
//        average         (0 0 0);
//        setAverage      no;
//        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
